fun main() {
//        print("Введите порядковый номер месяца (1-12): ")
//    val index = readln().toInt()
//    var month = ""
//    when (index) {
//        1 -> {
//            month = "январь"
//        }
//
//        2 -> {
//            month = "ффевраль"
//        }
//
//        3 -> {
//            month = "март"
//        }
//
//        4 -> {
//            month = "апрель"
//        }
//
//        5 -> {
//            month = "май"
//        }
//
//        6 -> {
//            month = "июнь"
//        }
//
//        7 -> {
//            month = "июль"
//        }
//
//        8 -> {
//            month = "август"
//        }
//
//        9 -> {
//            month = "сентябрь"
//        }
//
//        10 -> {
//            month = "октябрь"
//        }
//
//        11 -> {
//            month = "ноябрь"
//        }
//
//        12 -> {
//            month = "декабрь"
//
//        }
//
//        else -> "отсутствует месяц"
//    };
//    if (index in 1..12) {
//        println("Ваш индекс $index cоответствует месяцу $month")
//    }
//    else{
//        println("Индекс вне диапазона")
//    }

}